# RbsPipeSlopeOptionsDefParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeSlopeOptionsDefParam Property
ParameterTypeId Class See Also
---
"Pipe Slope Options"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeSlopeOptionsDefParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeSlopeOptionsDefParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeSlopeOptionsDefParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace